# Exercise 3: Data definition with SQL

In this exercise you will familiarize yourself with some of the DDL operations: creating and modifying tables and attributes.

- Load the SQL module

In [ ]:
%load_ext sql

- Connect to the PostgreSQL database:  
```python
%sql postgresql://username:password@server_address/database_name
```
  When using docker, the code below should be working.
  If you use a local installation, you may need to change the line usually to:
  - postgresql://user:\[yourpassword\]@localhost/postgres

In [ ]:
%sql postgresql://postgres:example@db:5432

If you wish to reset your database and start over, you can run the cell below (this will delete **all** tables you have created!).
Important: Restarting this notebook or the whole docker container does not delete the tables.

In [ ]:
%%sql
DROP TABLE IF EXISTS countries;
DROP TABLE IF EXISTS movies;
DROP TABLE IF EXISTS credits;
DROP TABLE IF EXISTS stars_in;
DROP TABLE IF EXISTS directed_by;
DROP TABLE IF EXISTS produced_by;
DROP TABLE IF EXISTS cards;
DROP TABLE IF EXISTS classes;
DROP TABLE IF EXISTS sets;
DROP TABLE IF EXISTS races;
DROP TABLE IF EXISTS minions;
DROP TABLE IF EXISTS abilities;
DROP TABLE IF EXISTS weapons;
DROP TABLE IF EXISTS playable_heroes;

**SQL Documentation (how to figure out the necessary synthax)**
- In some of the following tasks, we have linked to the official PostgreSQL documentation (e.g., the [CREATE TABLE command](https://www.postgresql.org/docs/14/static/sql-createtable.html)). While you may find help on platforms like stackoverflow, it is best to be able to read and understand the official documentation of PostgreSQL even if it may look complicated at first. This will enable you to understand all possible use-cases of an instruction and not just a specific example. If you prefer to learn by example, most documentation pages do contain a number of example when you scroll further down.
- Make sure to check out this [short guide](https://www.postgresql.org/docs/current/notation.html) on the formatting of the documentation. 
- If you want to find out how to do something in postgresql, you can use google and limit your search results to the official documentation (e.g., google "postgresql.org: create table") or use the [table of contents](https://www.postgresql.org/docs/14/index.html)
- Most of the documentation goes into more depth than we need. The most relevant chapters of the documentation are: _II. The SQL Language_ and _VI. Reference > I. SQL Commands_

**Now it is your turn!**
- Write SQL code to create the following ***countries*** table.  
  Select an appropriate SQL type for the domain of the attribute ***name***. We expect to store country names of at most 30 characters.  
  You may find this [link](https://www.postgresql.org/docs/14/static/sql-createtable.html) useful.
  
|name|
|:-:|
|string|

In [ ]:
%%sql

- Everytime you create/edit/delete a table in the database,  
  use the following command to see the results of your actions:  
  ```python
  %sql SELECT * FROM table_name
  ```

In [ ]:
%%sql 
SELECT * FROM countries;

- Write SQL code to insert the following tuple to the ***countries*** table.  
  You may find this [link](https://www.postgresql.org/docs/14/static/sql-insert.html) useful.  

|name|
|:-|
|Switzerland|

In [ ]:
%%sql

If something failed in the previous step, you have likely created a table with the incorrect table or field name or with the wrong SQL type.
You can use
```
%%sql
DROP TABLE countries;
```
to delete the table and try again.

* Check the table's contents.

In [ ]:
%%sql 
SELECT * FROM countries;

You should see a single tuple with the name 'Switzerland'.

- Write SQL code to insert the following tuples to the ***countries*** table.  
  Use a single SQL command to insert all the tuples.  
  
|name|
|:-|
|USA|
|Costa Rica|
|Iran|
|Kazakhstan|

In [ ]:
%%sql

* Check the table contents again:

In [ ]:
%%sql 
SELECT * FROM countries;

There should now be the 6 tuples we inserted so far.

- Write SQL code to drop the ***countries*** table.  
  You may find this [link](https://www.postgresql.org/docs/14/static/sql-droptable.html) useful.

In [ ]:
%%sql

- Write SQL code to create a ***countries*** table, with a single attribute ***name***, as before.  
  Use the SQL type *char(5)* for the domain of the ***name*** attribute.

In [ ]:
%%sql

* Check the contents.

In [ ]:
%%sql 
SELECT * FROM countries;

The table should now have a single attribute, 'name', and no tuples.

- Write SQL code to populate the ***countries*** table with the values below.  
  What result are you expecting?  
  
|name|
|:-|
|Switzerland|
|USA|
|Austria|
|Kazakhstan|
|Australia|

In [ ]:
%%sql

- You probably received an error stating that '... value too long for type character(5)'.  
  In practice, it often happens that the data to be inserted into a table do not fit the attribute domains properly. Although we should always strive to have a properly designed schema before inserting any data to our tables, there are legitimate cases where the data are malformed and it is better that they are formatted accordingly. Most database systems offer functionality towards that goal. For example, you can look at some functions that PostgreSQL offers for string manipulations [here](https://www.postgresql.org/docs/14/static/functions-string.html). You might be particularly interested in the function 'left(str text, n int)' in table 9-9.  
  Rewrite your last SQL command using the 'left' function, in order to overcome the above error.  
  What kind of result do you expect this time?

In [ ]:
%%sql

* Check the contents, it should match the following:

| name |
| :-: |
| Switz |
| USA |
| Austr |
| Kazak |
| Austr |

In [ ]:
%%sql 
SELECT * FROM countries;

- If you were expecting that there would be another error, because left('Austria', 5) is the same string as left('Australia', 5), then well done for remembering that tuples should be unique, but also welcome to the real world. Most database systems allow this in one way or another (it is not just PostgreSQL). We will see how we can actually enforce unique tuples next week.

- Insert a __second__ attribute to the ***countries*** table. Call it ***name*** and use the SQL type *CHAR(5)* again. Will it work?  
  You may find this [link](https://www.postgresql.org/docs/14/static/sql-altertable.html) useful.

In [ ]:
%%sql

* Check what's in the table now.

In [ ]:
%%sql
SELECT * FROM countries;

- Insert a __second__ attribute to the ***countries*** table. Call it ***name*** and use the SQL type *VARCHAR(30)* this time. What about this time?

In [ ]:
%%sql

- It seems that PostgreSQL will not allow you to have two attributes with the same name. Phew ... at least theory meets practice on this one! ;-)  
- Write SQL code to drop the existing ***name*** attribute in the ***countries*** table.

In [ ]:
%%sql

* Check the contents. You should see no tuples.

In [ ]:
%%sql
SELECT * FROM countries;

- Write the necessary SQL to __alter__ the ***countries*** table, so it has the attributes shown below.  
  Select SQL types that you think are appropriate for each of the attribute domains.  
  Try to select types that are not wasting too many bits/bytes, but that also allow all reasonable values for each attribute.  
  __Do not__ insert the tuples below into the table, but use them as a hint for the types that you should use.  
  You may consult PostgreSQL's [documentation](https://www.postgresql.org/docs/14/static/datatype-numeric.html).

|id|name|population|area [$km^2$]|gini|
|-:|:-|-:|-:|-:|
|number|string|number|number|number|
|1|China|1,403,500,365|9,596,961|46.1|
|2|Earth|7,442,100,000|510,072,000|-|

In [ ]:
%%sql

* Check the contents again.

In [ ]:
%%sql 
SELECT * FROM countries;

- Surprised by the result of SELECT? Maybe this is a hint of how PostgreSQL allows duplicate tuples in a table ...  
- Drop all attributes from the table ***countries***.

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM countries;

- Add the same attributes (***id***, ***name***, ***population***, ***area***, ***gini***) again to the table,  
  but this time place the constraint that ***id*** and ***name*** cannot be NULL. Allow the  
  rest attributes to take the NULL value.

In [ ]:
%%sql

- It should be obvious by now that deleting all attributes of a table does not actually remove the extension,  
  at least not completely. Although the 'how' and 'why' are beyond the scope of this exercise, it is something  
  that is good to have in mind. To amend the above error, first try to delete the extension of the table and then  
  try to add the attributes again. You may find this [link](https://www.postgresql.org/docs/14/static/sql-delete.html) useful.

In [ ]:
%%sql 
DELETE FROM countries;

* Check the contents, you should see '0 rows affected.'

In [ ]:
%%sql
SELECT * FROM countries;

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM countries;

- Populate the ***countries*** table with the following values:  

|id|name|population|area [$km^2$]|gini|
|-:|:-|-:|-:|-:|
|1|Switzerland|8401120|41285|29.5|
|2|USA|325365189|9833520|40.8|
|3|Cost Rica|4857274|51000|40.7|
|4|Iran|80829192|1648195|37.4|
|5|Kazakhstan|17987736|2724900|26.4|

In [ ]:
%%sql 
INSERT INTO countries
    (id, name, population, area, gini) 
VALUES
    (1, 'Switzerland', 8401120, 41285, 29.5), 
    (2, 'USA', 325365189, 9833520, 40.8), 
    (3, 'Cost Rica', 4857274, 51000, 40.7), 
    (4, 'Iran', 80829192, 1648195, 37.4), 
    (5, 'Kazakhstan', 17987736, 2724900, 26.4);

In [ ]:
%%sql 
SELECT * FROM countries;

- Try to create a second table named ***countries*** but with the attributes  ***name*** and ***continent*** and suitable domains. Will it work?

In [ ]:
%%sql

- If you have followed all the previous steps, then this leads to an error because you have already created a table named ***countries*** even though the attributes are different. This is also the reason why in the beginning we reset the database by running the commands `DROP TABLE IF EXISTS ...`.

- Create the following ***movies*** table:   
  
|title |year   |length |  
|:----:|:-----:|:-----:|  
|string|integer|integer|  

Constraints:
- ***title*** and ***year*** cannot be NULL
- ***length*** has default value 120 [link](https://www.postgresql.org/docs/12/static/ddl-default.html)

In [ ]:
%%sql

- Populate the ***movies*** table:

|title|year|length|
|----:|:--:|:----:|
|Bladerunner|1982|117|
|Arrival|2016|116| 
|La La Land|2016|128|  
|Bladerunner 2049|2017|163|

In [ ]:
%%sql
INSERT INTO movies
    (title, year, length) 
VALUES 
    ('Bladerunner', 1982, 117),
    ('Arrival', 2016, 116),
    ('La La Land', 2016, 128),
    ('Bladerunner 2049', 2017, 163);

In [ ]:
%sql SELECT * FROM movies;

- Add to the table ***movies*** the attribute ***genre***, with domain a string of up to 20 characters, with the constraint that it cannot be NULL.  
  Will this work?

In [ ]:
%%sql

- Do you understand why the command failed? (hint: check the actual error at the end of the traceback)   
  Let's try again. Try to add the attribute ***genre*** again, but this time set its default value to be 'Drama'.

In [ ]:
%%sql

* Check the contents, you should get this output:

| title	| year	| length	| genre |
| ----: | :-: | :-: | :-: |
| Bladerunner	| 1982	| 117	| Drama |
| Arrival	| 2016	| 116	| Drama |
| La La Land	| 2016	| 128	| Drama |
| Bladerunner 2049	| 2017	| 163	| Drama |

In [ ]:
%%sql 
SELECT * FROM movies;

- __Update__ the extension of the ***movies*** table, in order to get the following result (check [this](https://www.postgresql.org/docs/14/static/sql-update.html)):  

|title|year|length|genre| 
|----:|:--:|:----:|:---:|  
|Bladerunner|1982|117|Thriller|  
|Arrival|2016|116|Sci-Fi|  
|La La Land|2016|128|Drama|  
|Bladerunner 2049|2017|163|Thriller|

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM movies;

- Create the following ***credits*** table:  
   
|name  |birthdate|
|:----:|:-------:|
|string|date     |  

Constraints:
- ***name*** cannot be NULL
- ***birthdate*** can be NULL

In [ ]:
%%sql

- Change the ***birthdate*** attribute to have a default value of 1st of January, 1970.

In [ ]:
%%sql

- Populate the ***credits*** table:  

|name|birthdate|
|----------:|:-------:|
|Denis Villeneuve|03.10.1967|
|Amy Adams|20.08.1974|
|Ryan Gosling|12.11.1980|
|Harrison Ford|13.07.1942|
|Ridley Scott|30.11.1937|
|Emma Stone|06.11.1988|
|Rutger Hauer|-|
|Sean Young|20.11.1959|

In [ ]:
%%sql
INSERT INTO credits
    (name, birthdate) 
VALUES 
    ('Denis Villeneuve', '1967-10-03'), 
    ('Amy Adams', '1974-08-20'), 
    ('Ryan Gosling', '1980-11-12'), 
    ('Harrison Ford', '1942-07-12'), 
    ('Ridley Scott', '1937-11-30'), 
    ('Emma Stone', '1988-11-06'), 
    ('Rutger Hauer', DEFAULT), 
    ('Sean Young', '1959-11-20');

In [ ]:
%%sql 
SELECT * FROM credits;

- Rutger Hauer was born on the 23rd of January, 1944. Update the ***credits*** table accordingly.

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM credits;

- Create the following ***stars_in*** table:

|movie_title|movie_year|star_name|
|:--------:|:-------:|:--------|
|string    |integer  |string   |  

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***stars_in*** table:

|movie_title|movie_year|star_name|
|---------:|:-------:|:-------|
|Arrival|2016|Amy Adams|
|La La Land|2016|Ryan Gosling|
|La La Land|2016|Emma Stone|
|Bladerunner|1982|Rutger Hauer|
|Bladerunner|1982|Harrison Ford|
|Bladerunner|1982|Sean Young|
|Bladerunner 2049|2017|Ryan Gosling|
|Bladerunner 2049|2017|Harrison Ford|

In [ ]:
%%sql
INSERT INTO stars_in
    (movie_title, movie_year, star_name) 
VALUES 
    ('Arrival', 2016, 'Amy Adams'), 
    ('La La Land', 2016, 'Ryan Gosling'), 
    ('La La Land', 2016, 'Emma Stone'), 
    ('Bladerunner', 1982, 'Rutger Hauer'), 
    ('Bladerunner', 1982, 'Harrison Ford'), 
    ('Bladerunner', 1982, 'Sean Young'), 
    ('Bladerunner 2049', 2017, 'Ryan Gosling'), 
    ('Bladerunner 2049', 2017, 'Harrison Ford');

In [ ]:
%%sql 
SELECT * FROM stars_in;

- Create the following ***directed_by*** table:

|movie_title|movie_year|director_name|
|:--------:|:-------:|:----------:|
|string    |integer  |string      |  

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***directed_by*** table:  

|movie_title|movie_year|director_name|
|---------:|:-------:|:-------|
|Arrival|2016|Denis Villeneuve|
|Bladerunner|1982|Ridley Scott|
|Bladerunner 2049|2017|Denis Villeneuve|

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM directed_by;

- Create the ***produced_by*** table:

|movie_title|movie_year|producer_name|
|:--------:|:-------:|:----------:|
|string    |integer  |string      |  

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***produced_by*** table:  

|movie_title|movie_year|producer_name|
|---------:|:-------:|:-------|
|Bladerunner 2049|2017|Ridley Scott|

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM produced_by;

### *From here on it is only optional to solve the exercises as there are no new concepts*

- Create the following ***cards*** table:  

|id|name|
|-:|:-|
|integer|string|  

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***cards*** table:

|id|name|
|-:|:-|
|1|Explosive Trap|
|2|Crackle|
|3|Ysera|
|4|Mechanical Yeti|
|5|Frost Lich Jaina|
|6|Lord Jaraxxus|
|7|Gorehowl|
|8|Drakonid Operator|
|9|Kvaldir Raider
|10|Zombie Chow|
|11|Murloc Tinyfin|
|12|Grim Patron|

In [ ]:
%%sql
INSERT INTO cards
    (id, name) 
VALUES
    (1, 'Explosive Trap'),
    (2, 'Crackle'),
    (3, 'Ysera'),
    (4, 'Mechanical Yeti'),
    (5, 'Frost Lich Jaina'),
    (6, 'Lord Jaraxxus'),
    (7, 'Gorehowl'),
    (8, 'Drakonid Operator'),
    (9, 'Kvaldir Raider'),
    (10, 'Zombie Chow'),
    (11, 'Murloc Tinyfin'),
    (12, 'Grim Patron');

In [ ]:
%%sql 
SELECT * FROM cards;

- Create the following ***classes*** table:  

|name|
|:-|
|string|

Constraints:
- ***name*** cannot be NULL

In [ ]:
%%sql

- Populate the ***classes*** table:  

|name|
|:-|
|Neutral|
|Druid|
|Hunter|
|Mage|
|Paladin|
|Priest|
|Rogue|
|Shaman|
|Warlock|
|Warrior|

In [ ]:
%%sql
INSERT INTO classes
    (name) 
VALUES
    ('Neutral'), 
    ('Druid'), 
    ('Hunter'),
    ('Mage'), 
    ('Paladin'), 
    ('Priest'),
    ('Rogue'), 
    ('Shaman'), 
    ('Warlock'), 
    ('Warrior');

In [ ]:
%%sql 
SELECT * FROM classes;

- Create the following ***sets*** table:  

|name|
|:-|
|string|

Constraints:
- ***name*** cannot be NULL

In [ ]:
%%sql

- Populate the ***sets*** table:  

|name|
|:-|
|Basic|
|Expert|
|Curse of Naxxramas|
|Goblins vs Gnomes|
|Blackrock Mountain|
|The Grand Tournament|
|League of Explorers|
|Whispers of the Old Gods|
|Mean Streets of Gadgetzan|
|One Night in Karazhan|
|Journey to Un'Goro|
|Knights of the Frozen Throne|

In [ ]:
%%sql
INSERT INTO sets
    (name) 
VALUES
    ('Basic'), 
    ('Expert'), 
    ('Curse of Naxxramas'),
    ('Goblins vs Gnomes'), 
    ('Blackrock Mountain'), 
    ('The Grand Tournament'),
    ('League of Explorers'), 
    ('Whispers of the Old Gods'), 
    ('Mean Streets of Gadgetzan'),
    ('One Night in Karazhan'), 
    ('Journey to Un''Goro'), 
    ('Knights of the Frozen Throne');

In [ ]:
%%sql 
SELECT * FROM sets;

- Create the following ***races*** table:  

|name|
|:-|
|string|

Constraints:
- ***name*** cannot be NULL

In [ ]:
%%sql

- Populate the ***races*** table:  

|name|
|:-|
|Beast|
|Elemental|
|Demon|
|Dragon|
|Mech|
|Murloc|
|Pirate|
|Totem|

In [ ]:
%%sql
INSERT INTO races
    (name) 
VALUES
    ('Beast'), 
    ('Elemental'), 
    ('Demon'),
    ('Dragon'), 
    ('Mech'), 
    ('Murloc'), 
    ('Pirate'), 
    ('Totem');

In [ ]:
%%sql 
SELECT * FROM races;

- Create the following ***minions*** table: 

|name|mana|attack|health|race|class|set|
|:-|-:|-:|-:|:-|:-|:-|
|string|integer|integer|integer|string|string|string|

Constraints:
- ***race*** can be NULL
- No other attribute may be NULL

In [ ]:
%%sql

- Populate the ***minions*** table:

|name|mana|attack|health|race|class|set|
|:-|-:|-:|-:|:-|:-|:-|
|Ysera|9|4|12|Dragon|Neutral|Expert|
|Mechanical Yeti|4|4|5|Mech|Neutral|Goblins vs Gnomes|
|Lord Jaraxxus|9|3|15|Demon|Warlock|Expert|
|Drakonid Operator|5|5|6|Dragon|Priest|Mean Streets of Gadgetzan|
|Kvaldir Raider|5|4|4|-|Neutral|The Grand Tournament|
|Zombie Chow|1|2|3|-|Neutral|Curse of Naxxramas|
|Murloc Tinyfin|0|1|1|Murloc|Neutral|League of Explorers|
|Grim Patron|5|3|3|-|Neutral|Blackrock Mountain|

In [ ]:
%%sql
INSERT INTO minions
    (name, mana, attack, health, race, class, set) 
VALUES
    ('Ysera', 9, 4, 12, 'Dragon', 'Neutral', 'Expert'),
    ('Mechanical Yeti', 4, 4, 5, 'Mech', 'Neutral', 'Goblins vs Gnomes'),
    ('Lord Jaraxxus', 9, 3, 15, 'Demon', 'Warlock', 'Expert'), 
    ('Drakonid Operator', 5, 5, 6, 'Dragon', 'Priest', 'Mean Streets of Gadgetzan'), 
    ('Kvaldir Raider', 5, 4, 4, DEFAULT, 'Neutral', 'The Grand Tournament'), 
    ('Zombie Chow', 1, 2, 3, DEFAULT, 'Neutral', 'Curse of Naxxramas'),
    ('Murloc Tinyfin', 0, 1, 1, 'Murloc', 'Neutral', 'League of Explorers'),
    ('Grim Patron', 5, 3, 3, DEFAULT, 'Neutral', 'Blackrock Mountain');

In [ ]:
%%sql 
SELECT * FROM minions;

- Create the following ***abilities*** table:  

|name|mana|class|set|
|:-|-:|:-|:-|
|string|integer|string|string|

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***abilities*** table:  

|name|mana|class|set|
|:-|-:|:-|:-|
|Explosion Trap|2|Hunter|Expert|
|Crackle|2|Shaman|Goblins vs Gnomes|
|Mind Control|10|Priest|Basic|

In [ ]:
%%sql
INSERT INTO abilities
    (name, mana, class, set) 
VALUES
    ('Explosive Trap', 2, 'Hunter', 'Expert'),
    ('Crackle', 2, 'Shaman', 'Goblins vs Gnomes'),
    ('Mind Control', 10, 'Priest', 'Basic');

In [ ]:
%%sql 
SELECT * FROM abilities;

- Create the following ***weapons*** table:  

|name|mana|attack|durability|class|set|
|:-|-:|-:|-:|:-|:-|
|string|integer|integer|integer|string|string|

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***weapons*** table:  

|name|mana|attack|durability|class|set|
|:-|-:|-:|-:|:-|:-|
|Gorehowl|7|7|1|Warrior|Expert|

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM weapons;

- Create the following ***playable_heroes*** table:  

|name|mana|class|set|
|:-|-:|:-|:-|
|string|integer|string|string|

Constraints:
- None of the attributes may be NULL

In [ ]:
%%sql

- Populate the ***playable_heroes*** table:  

|name|mana|class|set|
|:-|-:|:-|:-|
|Frost Lich Jaina|9|Mage|Knights of the Frozen Throne|

In [ ]:
%%sql

In [ ]:
%%sql 
SELECT * FROM playable_heroes;